# 'brew tap'
#tap "homebrew/bundle"

# Installing Docker
cask "docker"

brew "mas" # Appstore CLI

# Important for playbooks
brew "dockutil"

# Installing core commands
brew "git"

# General
cask "arc" # Arc Browser
mas "WhatsApp", id: 310633997       # WhatsApp
mas "Element X", id: 1631335820     # Element X
cask "grandperspective"             # GrandPerspective
cask "betterdisplay"                # BetterDisplay

# Finances
mas "Budget Flow", id: 1640091876   # Budget Flow
cask "ledger-live"                  # Ledger Live

# University
cask "zotero"                       # Zotero
mas "ChatGPT", id: 6448311069       # ChatGPT

# Office
mas "Keynote", id: 409183694        # KeyNote

# Development
cask "jetbrains-toolbox"            # Jetbrains Toolbox
brew "kotlin"                       # kotlin
brew "kdoctor"                      # kdoctor
mas "Xcode", id: 497799835          # Xcode

# Zed Editor
cask "zed"                          # Zed

# Visual Studio Code
cask "visual-studio-code"           # Visual Studio Code
vscode "eamodio.gitlens"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
